'''
Ввод данных осуществляется из консоли путем использования функции input().
Вводимое число принимается с консоли и функция input() выдает введенную строку.
Далее эта строка переводится в число с помощью функции приведения типов int().
Необходимо использовать try except для перехвата исключений для ситуаций когда введенная строка не
является строковым представлением числа
Вывод результатов необходимо делать в консоль

18. Чётное/нечётное. if x % 2 == 0. x - вводится с консоли
'''

number_str = input('Введите целое число (int):')

try:
    number = int(number_str)
except ValueError as e:
    print('sorry this is not an integer! Please try again!')
    exit(0)

the_rest = number % 2
if the_rest == 0:
    print('X')
    exit(0)

print(f'You entered number {number}')