'''Задача 1. «Космическая регистрация»
(input, типы, f-strings, if/else, try/except, строковые методы)
Напиши программу, которая регистрирует астронавта перед полётом.

Что делает:
Спрашивает имя, фамилию и возраст.
Возраст нужно преобразовать в число. Если ввели не число, то через try/except вывести «Ошибка: возраст должен быть числом» и завершить.
Строку имени привести к виду «Имя Фамилия» с заглавных букв (первая буква — upper, остальное — lower).

Проверить условия допуска:
возраст от 25 до 55 → «Допущен к полёту»
возраст меньше 25 → «Слишком молод»
возраст больше 55 → «Слишком опытен для полёта»

Вывести карточку астронавта через f-строку:


=== КАРТОЧКА АСТРОНАВТА ===
Имя: Иван Петров
Возраст: 34
Статус: Допущен к полёту'''

name = input('Напиши имя Астрановта:')
surname = input('Напиши фамилию Астрановта:')
age_str = input('Напиши возраст Астрановта:')

try:
    age = int(age_str)
except ValueError:
    print("Ошибка: возраст должен быть числом")

if 25 < age < 55:
    s = "Допущен к полёту"
elif age < 25:
    s = 'Слишком молод'
else:
    s = "Слишком опытен для полёта"
print('=== КАРТОЧКА АСТРАНОВТА ===')
print(f'Имя: {name[0].upper() + name[1:].lower()} {surname[0].upper() + surname[1:].lower()}')
print(f'Возраст: {age}')
print(f'Статус: {s}')